# YOLOv8n + CBAM attention after P3/P4/P5 C2f blocks
# Baseline: yolov8n mAP50=0.542 (brain_tumor_n_noaug)
# Reference: YOLOv8-AM (arXiv), CBAM inserted after backbone feature layers

nc: 2
scales:
  n: [0.33, 0.25, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]       # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]      # 1-P2/4
  - [-1, 3, C2f, [128, True]]       # 2
  - [-1, 1, Conv, [256, 3, 2]]      # 3-P3/8
  - [-1, 6, C2f, [256, True]]       # 4
  - [-1, 1, CBAM, []]               # 5 ← CBAM on P3
  - [-1, 1, Conv, [512, 3, 2]]      # 6-P4/16
  - [-1, 6, C2f, [512, True]]       # 7
  - [-1, 1, CBAM, []]               # 8 ← CBAM on P4
  - [-1, 1, Conv, [1024, 3, 2]]     # 9-P5/32
  - [-1, 3, C2f, [1024, True]]      # 10
  - [-1, 1, CBAM, []]               # 11 ← CBAM on P5
  - [-1, 1, SPPF, [1024, 5]]        # 12

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 13
  - [[-1, 8], 1, Concat, [1]]                     # 14 cat P4 CBAM
  - [-1, 3, C2f, [512]]                           # 15

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 16
  - [[-1, 5], 1, Concat, [1]]                     # 17 cat P3 CBAM
  - [-1, 3, C2f, [256]]                           # 18 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]                    # 19
  - [[-1, 15], 1, Concat, [1]]                    # 20 cat head P4
  - [-1, 3, C2f, [512]]                           # 21 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                    # 22
  - [[-1, 12], 1, Concat, [1]]                    # 23 cat SPPF
  - [-1, 3, C2f, [1024]]                          # 24 (P5/32-large)

  - [[18, 21, 24], 1, Detect, [nc]]               # 25 Detect(P3, P4, P5)
